{
    "about" : {
        "greetings" : "Hello there",
        "shortBtn": "Short",
        "shortDescription" : "As a freelance full-stack developer based in the south of France, I have expertise in Angular and React for front-end and Node.js for back-end development. \n\nWith my extensive background in banking, I bring exceptional negotiation skills, flexibility, and rigor to every project. \n\nFrom static landing pages to e-commerce websites, I have worked on a variety of projects with autonomy and precision. \n\nIf you would like to learn more about me and my experience, please do not hesitate to contact me.",
        "mediumBtn": "Medium",
        "mediumDescription": "I am Jérôme, a freelance full-stack developer based in the south of France. \n\nWith a passion for new technologies, I have been developing web applications for various clients using Angular and React for front-end and Node.js for back-end development. \n\nMy extensive background in the banking sector has given me exceptional negotiation skills, flexibility, and rigor which I bring to every project I work on. \n\nMy expertise in both front-end and back-end development has enabled me to create clean and sharp code that generates accessible, user-friendly, and high-performing web applications. \n\nFrom static landing pages to e-commerce websites, I have worked on a variety of projects with autonomy and precision. \n\nAs a determined and tenacious developer, I am always eager to take on new challenges and put my diverse skill set to use in ambitious projects. \n\nIf you would like to learn more about me and my experience, please do not hesitate to contact me.",
        "longBtn": "Long",
        "longDescription" : "I am Jérôme, a professional and passionate developer based in the south of France. \n\nOver the years, my curiosity led me to explore different aspects of new technologies including 2 years as ambassador for Microsoft France (Microsoft’s “House of Fans” program). \n\nAfter a career in the banking sector, where I acquired and sharpened my listening skills, my flexibility and my rigor, I decided to get back to my true passion: coding. With great determination, I went back to school to finally get certificated in Web Development. \n\nThroughout this journey, I carried out multiple professional projects in perfect autonomy and precision. \n\nAt this moment, I am tenaciously looking to put my diverse and rich background at the service of ambitious and challenging projects. \n\nThanks to the manifold projects I have worked on, I have been able to manage both the front and the back end, giving me as global vision of the development of a web application. \n\nMy goal is to create a clean and sharp code that generates a web app that is both accessible, user-friendly and performing. \n\nIf you would like to know more about me and my projects feel free to contact me! \n\nWith my best regards,"
    }
}