{
    "home": {
        "greeting": "Hello, \nI'm Jérôme, \nFrontend Engineer.",
        "btnContact": "Send me a message",
        "btnMeeting": "Set up a meeting",
        "btnAbout": "Know More About Me"
    },
    "navbar": {
        "logo" : "/images/JB-logo2.png",
        "alt": "White J and B initials on a dark blue background.",
        "intern": {
            "home": {
                "label": "Home",
                "link": "/",
                "aria": "Go to homepage"
            },
            "about": {
                "label": "About",
                "link": "/about",
                "aria": "Go to about page"
            },
            "projects": {
                "label": "Projects",
                "link": "/projects",
                "aria": "Go to projects page"
            },
            "certifications": {
                "label": "Certifications",
                "link": "/certifications",
                "aria": "Go to certifications page"
            },
            "contact": {
                "label": "Contact",
                "link": "/contact",
                "aria": "Go to contact page"
            }
        },
        "extern": {
            "cv": {
                "label": "CV",
                "link": "/pdf/Jerome BAILLE - Frontend Developer.pdf"
            },
            "linkedIn": {
                "label": "LinkedIn Profile",
                "link": "https://www.linkedin.com/in/jerome-baille/"
            },
            "github": {
                "label": "GitHub Profile",
                "link": "https://github.com/Jerome-Baille"
            }
        }
    },
    "about" : {
        "greetings" : "Hello there",
        "signature": {
            "src": "/images/about/Signature.png",
            "alt": "Handwriten signature of Jerome."
        },
        "profilePicture": {
            "src": "/images/about/DSC_0703_2.JPG",
            "alt": "Jerome looking to his left. The picture is in black and white."
        },
        "descriptions": {
            "short": {
                "label": "Short",
                "content": "As a freelance full-stack developer based in the south of France, I have expertise in Angular and React for front-end and Node.js for back-end development. \n\nWith my extensive background in banking, I bring exceptional negotiation skills, flexibility, and rigor to every project. \n\nFrom static landing pages to e-commerce websites, I have worked on a variety of projects with autonomy and precision. \n\nIf you would like to learn more about me and my experience, please do not hesitate to contact me. \n\nWith my best regards,"
            },
            "medium": {
                "label": "Medium",
                "content":"I am Jérôme, a freelance full-stack developer based in the south of France. \n\nWith a passion for new technologies, I have been developing web applications for various clients using Angular and React for front-end and Node.js for back-end development. \n\nMy extensive background in the banking sector has given me exceptional negotiation skills, flexibility, and rigor which I bring to every project I work on. \n\nMy expertise in both front-end and back-end development has enabled me to create clean and sharp code that generates accessible, user-friendly, and high-performing web applications. \n\nFrom static landing pages to e-commerce websites, I have worked on a variety of projects with autonomy and precision. \n\nAs a determined and tenacious developer, I am always eager to take on new challenges and put my diverse skill set to use in ambitious projects. \n\nIf you would like to learn more about me and my experience, please do not hesitate to contact me. \n\nWith my best regards,"
            },
            "long":{
                "label": "Long",
                "content": "I am Jérôme, a professional and passionate developer based in the south of France. \n\nOver the years, my curiosity led me to explore different aspects of new technologies including 2 years as ambassador for Microsoft France (Microsoft’s “House of Fans” program). \n\nAfter a career in the banking sector, where I acquired and sharpened my listening skills, my flexibility and my rigor, I decided to get back to my true passion: coding. With great determination, I went back to school to finally get certificated in Web Development. \n\nThroughout this journey, I carried out multiple professional projects in perfect autonomy and precision. \n\nAt this moment, I am tenaciously looking to put my diverse and rich background at the service of ambitious and challenging projects. \n\nThanks to the manifold projects I have worked on, I have been able to manage both the front and the back end, giving me as global vision of the development of a web application. \n\nMy goal is to create a clean and sharp code that generates a web app that is both accessible, user-friendly and performing. \n\nIf you would like to know more about me and my projects feel free to contact me! \n\nWith my best regards,"
            }
        }
    },
    "projects": {
        "title": "My Curated Projects",
        "subtitle": "A small collection of recent projects I have worked on to get a better understanding of my skills and abilities. I have done them all together with amazing people. Please note that with the exception of the Groupomania project, I did not create the design of the website.",
        "skillsTitle": "Needed Skills",
        "stackTitle": "Stack Used",
        "improvementTitle": "Possible areas of improvement",
        "backBtn": "Back",
        "filters": {
            "label": "Filter by technology",
            "type": {
                "all": "All",
                "angular": "Angular",
                "react": "React",
                "nodejs": "NodeJs"
            }
        },
        "link": {
            "label": "See more details about "
        },
        "JobVisualiser": {
            "title": "Job Visualiser",
            "subtitle": "Job hunting made easy.",
            "logo": {
                "alt": "Dark blue circle whith 2 white curved lines inside, above the text Job Visualiser."
            },
            "pictures": {
                "mockup1": {
                    "alt": "Mockup of the dashboard on three different devices."
                },
                "mockup2": {
                    "alt": "Manual add of a job opportunity on mobile."
                },
                "mockup3": {
                    "alt": "Main dashboard on mobile."
                }
            },
            "descriptions": {
                "1": {
                    "content": "Job Visualiser is a 3 parts web application that helps users to visualise their job search process. It helps users to track their job search process and helps them to visualise their progress."
                },
                "2": {
                    "title": "The Chrome Extension",
                    "content": "The extension helps users to track their job search process by adding jobs to their dashboard. \nIt collects the title of the position, the company name, the location, the type of job (remote, hybrid or on site) and the date of application. \nIf the extension is not compatible with the website, the user can manually add the job from the dashboard."
                },
                "3": {
                    "title": "The Application Programming Interface (API)",
                    "content": "It allows both the extension and the dashboard to communicate with the database and to store the data. \nThe API is written in Node.JS with Express and uses MongoDB as a database. \nThe API is deployed on PlanetHoster."
                },
                "4": {
                    "title": "The Dashboard",
                    "content": "A dashboard that displays the jobs added by the user. The dashboard displays the jobs in a timeline and allows the user to filter the jobs by type of job (remote, hybrid or on site) and by status (approved, rejected, pending or unknown). \nThe dashboard also displays statistics regarding the user's job search process. The statistics are displayed in a pie chart. The pie chart displays the number of jobs by status. A table also displays the number of jobs by status per months and per weeks. \nThe dashboard allows the user to modify (eg. to add an interview date, or modify the status of the job application) or delete any job application. \nThe dashboard also displays the list of job boards used by the user. So that the user can easily access the job boards and apply for jobs. \nThe dashboard is written in React with the Bootstrap library. It uses React-Google-Chart to display the pie chart."
                }
            },
            "skills": [
                "Create a Google Chrome Extension.",
                "Create a dashboard with search bar and filters.",
                "Create a pie chart and a table.",
                "Create a CRUD to add, modify or delete the opportunities.",
                "Implement PDF and Excel export."
            ],
            "improvements": [
                "Add a favorite system to allow the user to save his favorite jobs."
            ]
        },
        "GameVerse":{
            "title": "Game Verse",
            "subtitle": "Different platforms, one application.",
            "logo": {
                "alt": "An owl holding a gaming console controller."
            },
            "pictures": {
                "mockup1": {
                    "alt": "Collection of games in grid form on a computer screen."
                },
                "mockup2": {
                    "alt": "Collection of games in list form on a smartphone screen."
                }
            },
            "descriptions" : {
                "1": {
                    "content": "Game Verse is an Angular PWA application that allows users to save all the games they own across different platforms in one place. \nThe application also allows to search in users' collection using keywords, or by filtering by genre or platform."
                }
            },
            "skills": [
                "Create a progressive web application", 
                "Create a dashboard with a search bar and filters",
                "Create a CRUD to add, modify or delete games",
                "Implement a service worker to allow the application to work offline",
                "Implement a database to store the games."
            ],
            "improvements": [
                "Add a rating system to allow users to rate games.",
                "Add a comment system to allow users to comment on games."
            ] 
        },
        "FlickPick":{
            "title": "Flick Pick",
            "subtitle": "Choose, watch, enjoy.",
            "logo": {
                "alt": "A popcorn bucket with eyes."
            },
            "pictures": {
                "mockup1": {
                    "alt": "List of movies matching the user's search on a computer screen."
                },
                "mockup2": {
                    "alt": "Detailed view of a movie displayed on a smartphone screen."
                }
            },
            "descriptions" : {
                "1": {
                    "content": "Flick Pick is an Angular PWA application that allows users to search for movies and series and add them to their collection. \nUsers can then create a group with other users and each member of the group is invited to play a game to determine the movie that will be watched by the group."
                }
            },
            "skills": [
                "Create a progressive web application", 
                "Create a dashboard with a search bar and filters",
                "Implement a service worker to allow the application to work offline",
                "Implement a database to store movies and series."
            ],
            "improvements": [
                "Implement a real-time system (socket) to make the game more dynamic."
            ] 
        },
        "PantryPal":{
            "title": "Pantry Pal",
            "subtitle": "All your favorite recipes in one place.",
            "logo": {
                "alt": "A chef's Angora cat surrounded by various ingredients and showing off a smartphone."
            },
            "pictures": {
                "mockup1": {
                    "alt": "List of all user recipes displayed in cards on a tablet screen."
                },
                "mockup2": {
                    "alt": "Details of a recipe displayed on a mobile screen."
                },
                "mockup3": {
                    "alt": "Grocery list generated by the user and displayed on a smartphone."
                }
            },
            "descriptions" : {
                "1": {
                    "content": "Pantry Pal is an Angular PWA application that lets users save all their favorite recipes in one place. \nThe app also lets users search for recipes based on the ingredients they have in their pantry. \nThe application is also available offline."
                }
            },
            "skills": [
                "Create a progressive web application", 
                "Create a dashboard with a search bar and filters",
                "Create a CRUD to add, modify or delete recipes",
                "Implement a sharing system to enable users to share their favorite recipes",
                "Implement a service worker to enable the application to work offline",
                "Implement a database to store recipes."
            ],
            "improvements": [
                "Add a rating system to allow users to rate recipes.",
                "Add a comment system to allow users to comment on recipes."
            ] 
        },
        "PhoceaTravel": {
            "title": "Phocea Travel",
            "subtitle": "Responsive website for a travel agency.",
            "logo": {
                "alt": "The text Phocea Travel written in blue on a white background."
            },
            "pictures": {
                "desktop": {
                    "alt": "Phocea Travel website on desktop"
                },
                "mobile": {
                    "alt": "Phocea Travel website on mobile"
                }
            },
            "descriptions" : {
                "1": {
                    "content": "Phocéa Travel is a small company offering a vacation planning tool! \nIts website allows users to find accommodations and activities in the city of their choice. \nAccommodations can also be filtered by theme, such as budget or ambiance."
                }
            },
            "skills": [
                "Integrate content according to a template.",
                "Implement a responsive interface."
            ],
            "improvements": [
                "Make the search bar functional.",
                "Add a database to turn the static website into a modern dynamic app.",
                "Link the website to google maps API to show the location of the accommodations.",
                "Add a login system to allow users to book accommodations."
            ]
        },
        "OhMyFood": {
            "title": "OhMyFood",
            "subtitle": "Dynamizing a web page with CSS animations.",
            "logo": {
                "alt": "The text Oh my food written in black on a white background."
            },
            "pictures": {
                "mockup1": {
                    "alt": "OhMyFood website, first mockup."
                },
                "mockup2": {
                    "alt": "OhMyFood website, second mockup."
                }
            },
            "descriptions" : {
                "1" : {
                    "content": "Ohmyfood! is a young startup that would like to impose itself on the restaurant market. \nThe objective is to develop a 100% mobile website that lists the menus of gourmet restaurants. \nIn addition to the classic reservation systems, customers will be able to compose the menu of their meal so that the dishes are ready when they arrive. \nNo more waiting in restaurants!"
                }
            },
            "skills": [
                "Implementing advanced graphic CSS effects",
                "Ensuring the graphic coherence of a website",
                "Setting up a Front-End environment",
                "Setting up a navigation structure for a website", 
                "Using a version management system for project monitoring and hosting"
            ],
            "improvements": [
                "Create a login system to allow users to save their favorite restaurants",
                "Create a system to book reservations",
                "Create a restaurant dashboard for restaurant owner to manage their own menu"
            ]
        },
        "LaChouetteAgence": {
            "title": "La Chouette Agence",
            "subtitle": "Optimization of an existing website.",
            "logo": {
                "alt": "The outline in orange and red of a stylized owl on black background.."
            },
            "pictures": {
                "mockup1": {
                    "alt": "La Chouette Agence website, first mockup."
                },
                "mockup2": {
                    "alt": "La Chouette Agence website, second mockup."
                }
            },
            "descriptions" : {
                "1" : {
                    "content": "La chouette agence is a large web design agency based in Lyon, France. \nDue to SEO problems, the website was only on the second page of search engines. \nAn SEO optimization was therefore performed and an improvement of the website's code in order to correct the display errors and improve the website's accessibility."
                }
            },
            "skills": [
                "Optimizing the size and speed of a website",
                "Ensuring the accessibility of a website",
                "Optimizing the referencing of a website",
                "Researching best practices in web development",
                "Writing maintainable HTML and CSS code"
            ],
            "improvements": [
                "Modify the format of the different images to improve speed and size"
            ]
        },
        "Kanap": {
            "title": "Kanap",
            "subtitle": "Building an e-commerce website in JavaScript.",
            "logo": {
                "alt": "A drawing of a sofa in a circle. All above the text Kanap."
            },
            "pictures": {
                "mockup1": {
                    "alt": "Kanap website, first mockup."
                },
                "mockup2": {
                    "alt": "Kanap website, second mockup."
                }
            },
            "descriptions" : {
                "1" : {
                    "content": "Kanap is a sofa brand that sells its products exclusively from its store. \nToday, the company wanted to have an e-commerce platform in addition to its physical store to sell its products on the Internet."
                }
            },
            "skills": [
                "Validating data from external sources",
                "Managing JavaScript events",
                "Creating a test plan for an application",
                "Interacting with a web service using JavaScript"
            ],
            "improvements": [
                "Create a login system to allow users to save their favorite products",
                "Create a login system to allow users to modify and/or keep track of their order"
            ]
        },
        "Piiquante": {
            "title": "Piiquante",
            "subtitle": "Building an API for a food review application.",
            "logo": {
                "alt": "A drawing of a pepper above the text Piiquante."
            },
            "pictures": {
                "mockup1": {
                    "alt": "Piiquante website, first mockup."
                },
                "mockup2": {
                    "alt": "Piiquante website, second mockup."
                }
            },
            "descriptions" : {
                "1" : {
                    "content": "Piiquante is a hot sauce company that wants to develop a hot sauce review web application called 'Hot Takes'. \nWhile Piiquante's product manager hopes to eventually turn the review application into an online store, she wants the first version to be a 'sauce gallery' that allows users to upload their favorite hot sauces and to like or dislike the sauces that others share."
                }
            },
            "skills": [
                "Implement a logical data model in accordance with regulations",
                "Implement CRUD operations in a secure manner",
                "Store data in a secure manner"
            ],
            "improvements": [
                "Create an online store to allow users to buy hot sauces",
                "Modify the code to prevent users from leaving the app on refresh"
            ]
        },
        "Groupomania": {
            "title": "Groupomania",
            "subtitle": "Creation of a company social network.",
            "logo": {
                "alt": "A circle in which you can see a grid. The whole above the text Groupomania."
            },
            "pictures": {
                "mockup1": {
                    "alt": "website, first mockup."
                },
                "mockup2": {
                    "alt": "website, second mockup."
                }
            },
            "descriptions" : {
                "1" : {
                    "content": "Groupomania is a group specialized in mass distribution. \nThe project consists of creating an internal social network for Groupomania employees. \nThe objective of this tool is to facilitate interactions between colleagues."
                }
            },
            "skills": [
                "Authenticating a user and maintaining their session",
                "Managing a data store using SQL",
                "Implementing secure data storage using SQL",
                "Customize the content sent to a web client"
            ],
            "improvements": [
                "Change the comment system to a nested one to allow for replies",
                "Implement a system to resize user's profile picture"
            ]
        }
    },
    "contact": {
        "title": "Contact Me",
        "subtitle": "If you want to know more about me or my projects, feel free to use the form below. I will answer you as soon as possible.",
        "form" : {
            "toast":{
                "success": {
                    "type": "success",
                    "title": "Success",
                    "message": "Your message has been sent successfully."
                },
                "error": {
                    "type": "error",
                    "title": "Error",
                    "message": "An error has occurred while sending your message. Please try again later."
                }
            },
            "inputs": {
                "name": {
                    "type": "text",
                    "label": "Name",
                    "placeholder": "Your name",
                    "required": "Please enter your name."
                },
                "email": {
                    "type": "email",
                    "label": "Email",
                    "placeholder": "Your email",
                    "invalid": "The e-mail address is not valid.",
                    "required": "Please enter your email."
                },
                "subject": {
                    "type": "text",
                    "label": "Subject",
                    "placeholder": "Subject of your message",
                    "required": "Please enter a subject."
                },
                "message": {
                    "type": "textarea",
                    "label": "Message",
                    "placeholder": "Your message",
                    "required": "Please enter a message."
                }
            },
            "btnContact": "SEND"
          }    
    },
    "certifications" : {
        "title": "Collection of Certifications",
        "subtitle": "As a developer, I understand the importance of continuous learning and professional development. Here, you'll find a showcase of my achievements and ongoing efforts to enhance my skills and knowledge in the field. Whether it's a course completed, a certification earned, or a diploma attained, I'm proud to share my journey with you.",
        "filters": {
            "label": "Filter by status",
            "type": {
                "all": "All",
                "completed": "Completed",
                "inProgress": "In Progress",
                "planned": "Planned"
            }
        },
        "modal": {
            "author": "Author",
            "type": "Type",
            "content": "Content",
            "source": "Source",
            "close": "Close"
        },
        "OpenClassroomsWebDeveloper": {
            "name" : "Web Developer",
            "type" : "Credited Professional Certificate",
            "descriptions" : "Build a responsive and dynamic website. \nCreate APIs and databases. \nOptimize the performance and carry out the maintenance of already existing web sites. \nManage a web project from A to Z."
        },
        "MetaFrontendDeveloper": {
            "name" : "Front-end Developer",
            "type" : "Professional Certificate",
            "descriptions" : "Introduction to Front-End Development. \nProgramming with JavaScript. \nVersion Control. \nHTML and CSS in depth. \nReact Basics. \nAdvanced React. \nPrinciples of UI/UX Design. \nFront-End Developer Capstone. \nCoding Interview Preparation."
        },
        "GoogleCybersecurity": {
            "name" : "Cybersecurity",
            "type" : "Professional Certificate",
            "descriptions" : "Foundations of Cybersecurity, \nPlay It Safe: Manage Security Risks, \nConnect and Protect: Networks and Network Security, \nTools of the Trade: Linux and SQL, \nAssets, Threats, and Vulnerabilities, \nSound the Alarm: Detection and Response, \nAutomate Cybersecurity Tasks with Python, \nPut It to Work: Prepare for Cybersecurity Jobs."
        },
        "GoogleUXDesign": {
            "name" : "UX Design",
            "type" : "Professional Certificate",
            "descriptions" : "Foundations of User Experience (UX) Design. \nStart the UX Design Process: Empathize, Define, and Ideate. \nBuild Wireframes and Low-Fidelity Prototypes. \nConduct UX Research and Test Early Concepts. \nCreate High-Fidelity Designs and Prototypes in Figma. \nResponsive Web Design in Adobe XD. \nDesign a User Experience for Social Good & Prepare for Jobs."
        },
        "MetaBackendDeveloper": {
            "name" : "Back-end Developer",
            "type" : "Professional Certificate",
            "descriptions" : "Introduction to Back-End Development. \nProgramming with Python. \nVersion Control. \nDatabases. \nDjango Web Framework. \nAPIs. \nThe Full Stack. \nCloud Computing. \nBack-End Developer Capstone. \nCoding Interview Preparation."
        },
        "GoogleProjectManager": {
            "name" : "Project Manager",
            "type" : "Professional Certificate",
            "descriptions" : "Foundations of Project Management. \nProject Initiation: Starting a Successful Project. \nProject Planning: Putting It All Together. \nProject Execution: Running the Project. \nCapstone: Applying Project Management in the Real World."
        },
        "AWSCloudPractitionerEssentials": {
            "name" : "AWS Cloud Practitioner Essentials",
            "type" : "Courses",
            "descriptions" : "Introduction to Amazon Web Services, Compute in the Cloud. \nGlobal Infrastructure and Reliability, Networking. \nStorage and Databases, Security. \nMonitoring and Analytics, Pricing and Support. \nMigration and Innovation, The Cloud Journey. \nAWS Certified Cloud Practitioner Basics."
        },
        "AWSDevOps":{
            "name" : "DevOps on AWS",
            "type" : "Specializations",
            "descriptions" : "AWS Cloud Technical Essentials. \nDevOps on AWS: Code, Build, and Test. \nDevOps on AWS: Release and Deploy. \nDevOps on AWS: Operate and Monitor."
        }
    },
    "error": {
        "404": {
            "title": "Oops! Error 404",
            "subtitle": "The page you are looking for does not exist.",
            "description": "Just click the button bellow to safely return home!",
            "btnHome": "HOME"
        },
        "500": {
            "title": "Oops! Error 500",
            "subtitle": "An error has occurred on the server. Please try again later.",
            "description": "Just click the button bellow to safely return home!",
            "btnHome": "HOME"
        }
    }
}