{
    "home": {
        "greeting": "Bonjour, \nJe suis Jérôme, \nIngénieur Frontend.",
        "btnContact": "Envoyez moi un message",
        "btnMeeting": "Plannifiez une rencontre",
        "btnAbout": "En Savoir Plus"
    },
    "navbar": {
        "logo": "/images/JB-logo2.png",
        "alt": "Les initiales J et B en blanc sur fond bleu foncé.",
        "intern": {
            "home": {
                "label": "Accueil",
                "link": "/",
                "aria": "Vers la page d'accueil"
            },
            "about": {
                "label": "À propos",
                "link": "/about",
                "aria": "Vers la page À propos"
            },
            "projects": {
                "label": "Projets",
                "link": "/projects",
                "aria": "Vers la page Projets"
            },
            "certifications": {
                "label": "Certificats",
                "link": "/certifications",
                "aria": "Vers la page Certificats"
            },
            "contact": {
                "label": "Contact",
                "link": "/contact",
                "aria": "Vers la page Contact"
            }
        },
        "extern": {
            "cv": {
                "label": "CV",
                "link": "/pdf/Jérôme BAILLE - Développeur Frontend.pdf"
            },
            "linkedIn": {
                "label": "Profil LinkedIn",
                "link": "https://www.linkedin.com/in/jerome-baille/"
            },
            "github": {
                "label": "Profil GitHub",
                "link": "https://github.com/Jerome-Baille"
            }
        }
    },
    "about" : {
        "greetings" : "Bonjour",
        "signature": {
            "src": "/images/about/Signature.png",
            "alt": "Signature manuscrite de Jerome."
        },
        "profilePicture": {
            "src": "/images/about/DSC_0703_2.JPG",
            "alt": "Jérôme regardant vers sa gauche. La photo est noir et blanc."
        },
        "descriptions": {
            "short": {
                "label": "Court",
                "content": "Je suis Jérôme, un développeur full-stack freelance basé dans le sud de la France, utilisant Angular et React pour le front-end et Node.js pour le back-end. \n\nGrâce mon expérience approfondie dans le secteur bancaire, j'apporte des capacités de négotiation exceptionnelles, de la flexibilité et de la rigueur à chaque projet. \n\nDes landing pages aux sites de e-commerce, j'ai travaillé sur une variété de projets avec autonomie et précision. \n\nSi vous souhaitez en savoir plus sur moi et mon expérience, n'hésitez pas à me contacter. \n\nCordialement,"
            },
            "medium": {
                "label": "Moyen",
                "content": "Je suis Jérôme, un développeur full-stack freelance basé dans le sud de la France. \n\nPassionné par les nouvelles technologies, j'ai développé des applications web pour divers clients en utilisant Angular et React pour le front-end et Node.js pour le développement back-end. \n\nMa vaste expérience dans le secteur bancaire m'a permis d'acquérir des compétences exceptionnelles en matière de négociation, de flexibilité et de rigueur que j'apporte à chaque projet sur lequel je travaille. \n\nMon expertise en développement front-end et back-end me permet d'écrire un code propre et précis qui génère des applications web accessibles, conviviales et performantes. \n\nDes landing pages statiques aux sites de e-commerce, j'ai travaillé sur une variété de projets avec autonomie et précision. En tant que développeur déterminé et tenace, je suis toujours prêt à relever de nouveaux défis et à mettre mes diverses compétences au service de projets ambitieux. \n\nSi vous souhaitez en savoir plus sur moi et mon expérience, n'hésitez pas à me contacter. \n\nCordialement,"
            },
            "long": {
                "label": "Long",
                "content": "Je suis Jérôme, un développeur professionnel et passionné basé dans le sud de la France. \n\nAu fil des années, ma curiosité et mon amour pour les nouvelles technologies m'ont conduit à explorer différentes facettes de ce domaine en constante évolution. \n\nAprès avoir fait carrière dans le secteur bancaire, j'ai acquis et développé des compétences précieuses telles que l'écoute active, la flexibilité et la rigueur. \n\nJ'ai ensuite eu la chance de faire partie du programme 'House of Fans' de Microsoft France en tant qu'ambassadeur. \n\nCette expérience m'a permis de rencontrer de nombreux professionnels du secteur et m'a poussé à faire de ma passion de toujours un véritable métier. \n\nC'est ainsi que j'ai décidé de me former en autodidacte. Puis, pour valider mes compétences et acquérir une certification reconnue, j'ai décidé de reprendre le chemin de l'école pour obtenir un diplôme en développement web. \n\nDurant cette période, j'ai pû réaliser différents projets professionnels, en parfaite autonomie et en appliquant les compétences que j'avais acquises en autodidacte. \n\nJ'ai pu ainsi développer une approche pragmatique et méthodique, en combinant les connaissances théoriques avec une expérience pratique significative. \n\nAujourd'hui, je suis déterminé à mettre mon parcours riche et varié au service de projets ambitieux et stimulants. \n\nGrâce aux multiples projets sur lesquels j'ai travaillé, j'ai acquis une vision globale du développement d'une application web, en étant capable de gérer à la fois le front-end et le back-end. \n\nMon objectif principal est de créer un code propre et précis qui permet de développer des applications web performantes, conviviales et accessibles. Je suis toujours à la recherche de nouvelles opportunités de développement professionnelles et je suis convaincu que mon profil polyvalent et mon engagement pour l'excellence peuvent apporter une véritable valeur ajoutée à votre entreprise. \n\nSi vous êtes intéressé par mon profil et souhaitez en savoir plus sur moi et mes projets, n'hésitez pas à me contacter ! \n\nCordialement,"
            }
        }
    },
    "projects": {
        "title": "Sélection de Projets",
        "subtitle": "Une petite collection de projets récents sur lesquels j'ai travaillé pour améliorer mes compétences et mes capacités. Je les ai tous réalisés en collaboration avec des gens extraordinaires. Veuillez noter qu'à l'exception du projet Groupomania, je n'ai pas créé le design du site web.",
        "skillsTitle": "Compétences nécessaires",
        "stackTitle": "Stack utilisée",
        "improvementTitle": "Possibles améliorations",
        "backBtn": "Retour",
        "filters": {
            "label": "Filtrer par technologie",
            "type": {
                "all": "Toutes",
                "angular": "Angular",
                "react": "React",
                "nodejs": "NodeJs"
            }
        },
        "link": {
            "label": "Voir plus de détails à propos de  "
        },
        "JobVisualiser": {
            "title": "Job Visualiser",
            "subtitle": "La recherche d'emploi en toute simplicité.",
            "logo": {
                "alt": "Cercle bleu foncé avec 2 lignes courbes blanches à l'intérieur, au-dessus du texte Job Visualiser."
            },
            "pictures": {
                "mockup1": {
                    "alt": "Maquette du tableau de bord sur trois appareils différents."
                },
                "mockup2": {
                    "alt": "Ajout manuel d'une candidature sur mobile."
                },
                "mockup3": {
                    "alt": "Tableau de bord principal sur mobile."
                }
            },
            "descriptions": {
                "1": {
                    "content": "Job Visualiser est une application web composée de 3 parties qui aide les utilisateurs à visualiser leur processus de recherche d'emploi. Il aide les utilisateurs à suivre leur processus de recherche d'emploi et à les aider à visualiser leur progression."
                },
                "2": {
                    "title": "L'extension Google Chrome",
                    "content": "L'extension aide les utilisateurs à suivre leur processus de recherche d'emploi en ajoutant des emplois à leur tableau de bord. \nIl recueille le titre du poste, le nom de la société, l'emplacement, le type d'emploi (à distance, hybride ou sur site) et la date de candidature. \nSi l'extension n'est pas compatible avec le site Web, l'utilisateur peut ajouter manuellement le poste depuis le tableau de bord."
                },
                "3": {
                    "title": "L'interface de programmation d'applications (API)",
                    "content": "Il permet à l'extension et au tableau de bord de communiquer avec la base de données et de stocker les données. \nL'API est écrite en Node.JS avec Express et utilise MongoDB comme base de données. \nL'API est déployée sur PlanetHoster."
                },
                "4": {
                    "title": "Le tableau de bord",
                    "content": "Un tableau de bord qui affiche les emplois ajoutés par l'utilisateur. Le tableau de bord affiche les emplois par ordre chronologique et permet à l'utilisateur de filtrer les emplois par type (à distance, hybride ou sur site) et/ou par statut (approuvé, rejeté, en attente ou inconnu). \nLe tableau de bord affiche également des statistiques concernant le processus de recherche d'emploi de l'utilisateur. Le graphique circulaire affiche le nombre d'emplois par statut. Un tableau affiche également des statistiques détaillées (par mois et par semaine). \nLe tableau de bord permet à l'utilisateur de modifier (par exemple, pour ajouter une date d'entretien ou modifier le statut de la candidature) ou de supprimer une candidature. \nLe tableau de bord affiche également la liste des sites Web d'offres d'emploi utilisés par l'utilisateur. Ainsi, l'utilisateur peut facilement accéder aux sites Web d'offres d'emploi et postuler. \nLe tableau de bord est écrit en React avec la bibliothèque Bootstrap. Il utilise React-Google-Chart pour afficher le graphique circulaire."
                }
            },
            "skills": [
                "Create a Google Chrome Extension.",
                "Create a dashboard with search bar and filters.",
                "Create a pie chart and a table.",
                "Create a CRUD to add, modify or delete the opportunities.",
                "Implement PDF and Excel export."
            ],
            "improvements": [
                "Add a favorite system to allow the user to save his favorite jobs."
            ]
        },
        "PhoceaTravel": {
            "title": "Phocea Travel",
            "subtitle": "Site web responsive pour une agence de voyage.",
            "logo": {
                "alt": "Le texte Phocean Travel en bleu sur fond blanc."
            },
            "pictures": {
                "desktop": {
                    "alt": "Site internet de Phocea Travel sur ordinateur"
                },
                "mobile": {
                    "alt": "Site internet de Phocea Travel sur mobile"
                }
            },
            "descriptions" : {
                "1": {
                    "content": "Phocéa Travel est une petite entreprise offrant un outil de planification de vacances ! \nSon site web permet aux utilisateurs de trouver des hébergements et des activités dans la ville de leur choix. \nLes hébergements peuvent également être filtrés par thème, comme le budget ou l'ambiance."
                }
            },
            "skills": [
                "Intégrer du contenu selon un template.", 
                "Implémenter une interface responsive."
            ],
            "improvements": [
                "Rendre la barre de recherche fonctionnelle.",
                "Ajouter une base de données pour transformer le site web statique en une application moderne dynamique.",
                "Lier le site web à l'API google maps pour afficher l'emplacement des hébergements.",
                "Ajouter un système de connexion pour permettre aux utilisateurs de réserver des hébergements."
            ]
        },
        "OhMyFood": {
            "title": "OhMyFood",
            "subtitle": "Dynamiser une page web avec des animations CSS.",
            "logo": {
                "alt": "Le texte Oh my food en noir sur fond blanc."
            },
            "pictures": {
                "mockup1": {
                    "alt": "Site internet d'OhMyFood, première maquette."
                },
                "mockup2": {
                    "alt": "Site internet d'OhMyFood, deuxième maquette."
                }
            },
            "descriptions" : {
                "1": {
                    "content": "Ohmyfood! est une jeune startup qui souhaite s'imposer sur le marché des restaurants. \nL'objectif est de développer un site web 100% mobile qui répertorie les menus de restaurants gastronomiques. \nEn plus des systèmes de réservation classiques, les clients pourront composer le menu de leur repas afin que les plats soient prêts à leur arrivée. \nPlus d'attente dans les restaurants !"
                }
            },
            "skills": [
                "Implémenter des effets graphiques CSS avancés",
                "Assurer la cohérence graphique d'un site web",
                "Mettre en place un environnement Front-End",
                "Mettre en place une structure de navigation pour un site web",
                "Utiliser un système de gestion de versions pour le suivi et l'hébergement du projet"
            ],    
            "improvements": [
                "Créer un système de connexion pour permettre aux utilisateurs de sauvegarder leurs restaurants préférés",
                "Créer un système de réservation",
                "Créer un tableau de bord pour les propriétaires de restaurants pour gérer leur propre menu"
            ]
        },
        "LaChouetteAgence": {
            "title": "La Chouette Agence",
            "subtitle": "Optimisation d'un site web existant.",
            "logo": {
                "alt": "Le contour en orange et rouge d'une chouette stylisée sur fond noir."
            },
            "pictures": {
                "mockup1": {
                    "alt": "Site internet de La Chouette Agence, first mockup."
                },
                "mockup2": {
                    "alt": "Site internet de La Chouette Agence, second mockup."
                }
            },
            "descriptions": {       
                "1": {
                    "content": "La chouette agence est une grande agence de web design basée à Lyon, France. \nEn raison de problèmes de référencement, le site web n'était que sur la deuxième page des moteurs de recherche. \nUne optimisation SEO a donc été effectuée et une amélioration du code du site web afin de corriger les erreurs d'affichage et d'améliorer l'accessibilité du site web."
                }
            },
            "skills": [
                "Optimiser la taille et la vitesse d'un site web",
                "Assurer l'accessibilité d'un site web",
                "Optimiser le référencement d'un site web",
                "Rechercher les meilleures pratiques en développement web",
                "Rédiger un code HTML et CSS maintenable"
            ],
            "improvements": [
                "Modifier le format des différentes images afin d'améliorer la vitesse et la taille"
            ]
        },
        "Kanap": {
            "title": "Kanap",
            "subtitle": "Création d'un site e-commerce en JavaScript",
            "logo": {
                "alt": "Un dessin d'un canapé dans un cercle. Le tout au dessus du texte Kanap."
            },
            "pictures": {
                "mockup1": {
                    "alt": "Site internet de Kanap, première maquette."
                },
                "mockup2": {
                    "alt": "Site internet de Kanap, deuxième maquette."
                }
            },
            "descriptions" : {
                "1": {
                    "content": "Kanap est une marque de canapé qui vend ses produits exclusivement depuis son magasin. \nAujourd'hui, l'entreprise souhaitait avoir une plateforme e-commerce en plus de son magasin physique pour vendre ses produits sur Internet."
                }
            },
            "skills": [
                "Valider des données provenant de sources externes",
                "Gérer les événements JavaScript",
                "Créer un plan de test pour une application",
                "Interagir avec un service web à l'aide de JavaScript"
            ],
            "improvements": [
                "Créer un système de connexion pour permettre aux utilisateurs de sauvegarder leurs produits préférés",
                "Créer un système de connexion pour permettre aux utilisateurs de modifier et/ou suivre leur commande"
            ]
        },
        "Piiquante": {
            "title": "Piiquante",
            "subtitle": "Création d'une API pour une application de critique culinaire.",
            "logo": {
                "alt": "Un dessin d'un piment au dessus du texte Piiquante."
            },
            "pictures": {
                "mockup1": {
                    "alt": "Site internet de Piiquante, première maquette."
                },
                "mockup2": {
                    "alt": "Site internet de Piiquante, deuxième maquette."
                }
            },
            "descriptions" : {
                "1": {
                    "content": "Piiquante est une entreprise de sauce piquante qui souhaite développer une application web de critique de sauce piquante appelée 'Hot Takes' \nAlors que la responsable produit de Piiquante espère à terme transformer l'application de critique en boutique en ligne, elle souhaite que la première version soit une 'galerie de sauces' qui permet aux utilisateurs de télécharger leurs sauces piquantes préférées et de liker ou disliker les sauces que partagent les autres."
                }
            },
            "skills": [
                "Mettre en œuvre un modèle de données logique conformément aux réglementations",
                "Mettre en œuvre des opérations CRUD de manière sécurisée",
                "Stocker des données de manière sécurisée"
            ],
            "improvements": [
                "Créer une boutique en ligne pour permettre aux utilisateurs d'acheter des sauces piquantes",
                "Modifier le code pour empêcher les utilisateurs de quitter l'application lors du rafraîchissement"
            ]
        },
        "Groupomania": {
            "title": "Groupomania",
            "subtitle": "Création d'un réseau social d'entreprise.",
            "logo": {
                "alt": "Un cercle dans lequel on peut voir un quadrillage. Le tout au dessus du texte Groupomania."
            },
            "pictures": {
                "mockup1": {
                    "alt": "Site internet de Groupomania, première maquette."
                },
                "mockup2": {
                    "alt": "Site internet de Groupomania, deuxième maquette."
                }
            },
            "descriptions" : {
                "1": {
                    "content": "Groupomania est un groupe spécialisé dans la distribution de masse. \nLe projet consiste à construire un réseau social interne pour les employés de Groupomania. \nL'objectif de cet outil est de faciliter les interactions entre collègues."
                }
            },
            "skills": [
                "Authentifier un utilisateur et maintenir sa session",
                "Gérer un stockage de données à l'aide de SQL",
                "Mettre en œuvre un stockage de données sécurisé à l'aide de SQL",
                "Personnaliser le contenu envoyé à un client Web"
            ],
            "improvements": [
                "Changer le système de commentaires en un système imbriqué pour permettre des réponses",
                "Mettre en œuvre un système de redimensionnement de la photo de profil de l'utilisateur"
            ]
        }
    },
    "contact": {
        "title" : "Contactez Moi",
        "subtitle": "Si vous voulez en savoir plus sur moi ou mes projets, n'hésitez pas à utiliser le formulaire ci-dessous. Je vous répondrai dans les plus brefs délais.",
        "form" : {
            "toast":{
                "success": {
                    "type": "success",
                    "title": "Success",
                    "message": "Votre message a été envoyé avec succès."
                },
                "error": {
                    "type": "error",
                    "title": "Erreur",
                    "message": "Une erreur s'est produite lors de l'envoi de votre message. Veuillez réessayer plus tard."
                }
            },
          "inputs" : { 
            "name": {
                "type": "text",
                "label": "Nom",
                "placeholder": "Entrez votre nom",
                "required": "Veuillez entrer votre nom."
            },
            "email": {
                "type": "email",
                "label": "Email",
                "placeholder": "Entrez votre adresse e-mail",
                "required": "Veuillez entrer votre email.",
                "invalid": "Veuillez entrer un email valide."
            },
            "subject": {
                "type": "text",
                "label": "Sujet",
                "placeholder": "Entrez le sujet de votre message",
                "required": "Veuillez entrer le sujet de votre message."
            },
            "message": {
                "type": "textarea",
                "label": "Message",
                "placeholder": "Entrez votre message",
                "required": "Veuillez entrer votre message."
            }
        },
          "btnContact": "ENVOYER"
        }
    },
    "certifications" : {
        "title": "Collection de Certificats",
        "subtitle": "En tant que développeur, je comprends l'importance de l'apprentissage continu et du développement professionnel. Vous trouverez ici une vitrine de mes réalisations et de mes efforts continus pour améliorer mes compétences et mes connaissances dans le domaine. Qu'il s'agisse d'un cours, d'une certification ou d'un diplôme, je suis fier de partager mon parcours avec vous.",
        "filters": {
            "label": "Filtrer par statut",
            "type": {
                "all": "Tous",
                "completed": "Terminé",
                "inProgress": "En Cours",
                "planned": "A Venir"
            }
        },
        "modal": {
            "author": "Auteur",
            "type": "Type",
            "content": "Contenu",
            "source": "Source",
            "close": "Fermer"
        },
        "OpenClassroomsWebDeveloper": {
            "name" : "Développeur Web",
            "type" : "RNCP Niveau 5",
            "descriptions" : "Construire un site web responsive et dynamique. \nCréer des API et des bases de données. \nOptimiser les performances et réaliser la maintenance de sites web déjà existants. \nGérer un projet web de A à Z."
        },
        "MetaFrontendDeveloper": {
            "name" : "Développeur Front-end",
            "type" : "Certificat Professionnel",
            "descriptions" : "Introduction au développement Front-End, \nProgrammation avec JavaScript, \nContrôle de version, \nHTML et CSS avancés, \nLes bases de React, \nReact avancé, \nPrincipes de conception UI/UX, \nPierre angulaire du développeur Front-End, \nPréparation à l'entretien d'embauche"
        },
        "GoogleUXDesign": {
            "name" : "Conception UX",
            "type" : "Certificat Professionnel",
            "descriptions" : "Fondements de la conception de l'expérience utilisateur (UX), \nDémarrer le processus de conception UX : Empathiser, définir et imaginer, \nConstruire des wireframes et des prototypes basse fidélité, \nMener des recherches UX et tester les premiers concepts, \nCréer des conceptions et des prototypes haute-fidélité avec Figma, \nConcevoir des sites web réactifs avec Adobe XD, \nConcevoir une expérience utilisateur pour le bien social et se préparer à l'emploi"
        },
        "MetaBackendDeveloper": {
            "name" : "Développeur Back-end",
            "type" : "Certificat Professionnel",
            "descriptions" : "Introduction au développement back-end, \nProgrammation en Python, \nContrôle de version, \nBases de données, \nDjango Web Framework, \nAPI, \nFull Stack, \nCloud Computing, \nPierre angulaire du développeur back-end, \nPréparation aux entretiens techniques"
        },
        "GoogleProjectManager": {
            "name" : "Project Manager",
            "type" : "Professional Certificate",
            "descriptions" : "Fondements de la gestion de projet, \nInitiation du projet : Démarrer un projet réussi, \nPlanification de projet : La mise en place de l'ensemble, \nExécution du projet : Exécuter le projet, \nGestion de projet agile, \nCapstone : Appliquer la gestion de projet dans le monde réel"
        },
        "AWSCloudPractitionerEssentials": {
            "name" : "AWS Cloud Practitioner Essentials",
            "type" : "Cours",
            "descriptions" : "Introduction aux services Web d'Amazon, calcul dans le nuage, \nInfrastructure globale et fiabilité, mise en réseau, \nStockage et bases de données, \nSécurité, \nSurveillance et analyse, tarification et assistance, \nMigration et innovation, le voyage dans le nuage, \nLes bases de la certification AWS (AWS Certified Cloud Practitioner Basics)"  
        },
        "AWSDevOps":{
            "name" : "DevOps on AWS",
            "type" : "Spécialisation",
            "descriptions" : "Essentiels techniques du cloud AWS, \nDevOps sur AWS : Code, Build, and Test, \nDevOps sur AWS : Release and Deploy, \nDevOps sur AWS : Exploiter et surveiller"
        }
    },
    "error": {
        "404": {
            "title": "Oops! Erreur 404",
            "subtitle": "La page que vous recherchez n'existe pas ou a été déplacée.",
            "description": "Cliquez sur le bouton ci-dessous pour revenir à la page d'accueil.",
            "btnHome": "Retour à l'accueil"
        },
        "500": {
            "title": "Oops! Erreur 500",
            "subtitle": "Une erreur a eu lieu sur le serveur. Veuillez réessayer plus tard.",
            "description": "Cliquez sur le bouton ci-dessous pour revenir à la page d'accueil.",
            "btnHome": "Retour à l'accueil"
        }
    }
}