{
    "about" : {
    "greetings" : "Bonjour",
    "shortBtn" : "court",
    "shortDescription" : "Je suis Jérôme, un développeur full-stack freelance basé dans le sud de la France, utilisant Angular et React pour le front-end et Node.js pour le back-end. \n\nGrâce mon expérience approfondie dans le secteur bancaire, j'apporte des capacités de négotiation exceptionnelles, de la flexibilité et de la rigueur à chaque projet. \n\nDes landing pages aux sites de e-commerce, j'ai travaillé sur une variété de projets avec autonomie et précision. \n\nSi vous souhaitez en savoir plus sur moi et mon expérience, n'hésitez pas à me contacter.",
    "mediumBtn" : "moyen",
    "mediumDescription": "Je suis Jérôme, un développeur full-stack freelance basé dans le sud de la France. \n\nPassionné par les nouvelles technologies, j'ai développé des applications web pour divers clients en utilisant Angular et React pour le front-end et Node.js pour le développement back-end. \n\nMa vaste expérience dans le secteur bancaire m'a permis d'acquérir des compétences exceptionnelles en matière de négociation, de flexibilité et de rigueur que j'apporte à chaque projet sur lequel je travaille. \n\nMon expertise en développement front-end et back-end me permet d'écrire un code propre et précis qui génère des applications web accessibles, conviviales et performantes. \n\nDes landing pages statiques aux sites de e-commerce, j'ai travaillé sur une variété de projets avec autonomie et précision. En tant que développeur déterminé et tenace, je suis toujours prêt à relever de nouveaux défis et à mettre mes diverses compétences au service de projets ambitieux. \n\nSi vous souhaitez en savoir plus sur moi et mon expérience, n'hésitez pas à me contacter.",
    "longBtn" : "long",
    "longDescription" : "Je suis Jérôme, un développeur professionnel et passionné basé dans le sud de la France. \n\nAu fil des années, ma curiosité et mon amour pour les nouvelles technologies m'ont conduit à explorer différentes facettes de ce domaine en constante évolution. \n\nAprès avoir fait carrière dans le secteur bancaire, j'ai acquis et développé des compétences précieuses telles que l'écoute active, la flexibilité et la rigueur. \n\nJ'ai ensuite eu la chance de faire partie du programme 'House of Fans' de Microsoft France en tant qu'ambassadeur. \n\nCette expérience m'a permis de rencontrer de nombreux professionnels du secteur et m'a poussé à faire de ma passion de toujours un véritable métier. \n\nC'est ainsi que j'ai décidé de me former en autodidacte. Puis, pour valider mes compétences et acquérir une certification reconnue, j'ai décidé de reprendre le chemin de l'école pour obtenir un diplôme en développement web. \n\nDurant cette période, j'ai pû réaliser différents projets professionnels, en parfaite autonomie et en appliquant les compétences que j'avais acquises en autodidacte. \n\nJ'ai pu ainsi développer une approche pragmatique et méthodique, en combinant les connaissances théoriques avec une expérience pratique significative. \n\nAujourd'hui, je suis déterminé à mettre mon parcours riche et varié au service de projets ambitieux et stimulants. \n\nGrâce aux multiples projets sur lesquels j'ai travaillé, j'ai acquis une vision globale du développement d'une application web, en étant capable de gérer à la fois le front-end et le back-end. \n\nMon objectif principal est de créer un code propre et précis qui permet de développer des applications web performantes, conviviales et accessibles. Je suis toujours à la recherche de nouvelles opportunités de développement professionnelles et je suis convaincu que mon profil polyvalent et mon engagement pour l'excellence peuvent apporter une véritable valeur ajoutée à votre entreprise. \n\nSi vous êtes intéressé par mon profil et souhaitez en savoir plus sur moi et mes projets, n'hésitez pas à me contacter ! Cordialement,"
    }
}